# SiteCannotDrawSurfaceBoundary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SiteCannotDrawSurfaceBoundary Property
BuiltInFailures..::..SketchFailures Class See Also
---
Cannot make surface with specified boundary.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SiteCannotDrawSurfaceBoundary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SiteCannotDrawSurfaceBoundary As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SiteCannotDrawSurfaceBoundary {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace